/*!-----------------------------------------------------------------------------
@file       DateTimeProvider.cpp
@brief      
@attention  なし
------------------------------------------------------------------------------*/
#include "stdafx.h"
#include "DateTimeProvider.h"

/*!-----------------------------------------------------------------------------
@brief      デフォルトコンストラクタ
@note       クラスを構築する。
@param[in]  なし
@return     なし
@attention  なし
------------------------------------------------------------------------------*/
DateTimeProvider::DateTimeProvider(){

}

/*!-----------------------------------------------------------------------------
@brief      デストラクタ
@note       クラスを破棄する。
@param      なし
@return     なし
@attention  なし
------------------------------------------------------------------------------*/
DateTimeProvider::~DateTimeProvider(){

}

/*!-----------------------------------------------------------------------------
@brief      
@note       
@param      なし
@return     なし
@attention  なし
------------------------------------------------------------------------------*/
COleDateTime DateTimeProvider::getCurrentTime(){

    return  COleDateTime::GetDay();
}